#+TITLE: Programming Challenge
#+AUTHOR: Roberto López
#+FILETAGS: PYTHON

* Installation

  This project is managed with [[https://poetry.eustace.io/][Poetry]]. The steps I followed to [[https://poetry.eustace.io/docs/#installation][install]] it were.

  - I choosed the not-so-recommended [[https://poetry.eustace.io/docs/#installing-with-pip][pip alternative]] to install it.
  
    #+BEGIN_SRC sh :results output
      python -m pip install --user poetry
    #+END_SRC
  
    [[https://pip.pypa.io/en/stable/#pip][pip]] was because like that because of a [[https://stackoverflow.com/questions/28210269/importerror-cannot-import-name-main-when-running-pip-version-command-in-windo][pip import error]].

  - After [[https://poetry.eustace.io/][poetry]] was installed with [[https://pip.pypa.io/en/stable/#pip][pip]], let it to update itself.
  
    #+BEGIN_SRC sh :results output
      poetry self:update
    #+END_SRC
    #+RESULTS: 
    : You are using the latest version

  [[https://git-scm.com/docs/git-clone][Clone]] this project repository into your local machine.

  #+BEGIN_SRC sh
    git clone https://github.com/ixemad/devorame.git
  #+END_SRC

  Move to the project folder and run [[https://poetry.eustace.io/docs/basic-usage/#installing-dependencies][poetry install]] to resolve all the dependencies. Run [[https://pytest.org/][pytest]] to
  validate that the application was installed correctly.

  #+BEGIN_SRC sh
    poetry run pytest --verbose
  #+END_SRC

  Finally, invoke the [[https://poetry.eustace.io/docs/cli/#run][run]] command in the project folder as shown below to execute this application
  without installing it.

  #+BEGIN_SRC sh
    poetry run devorame --help
  #+END_SRC

